Samsung/TizenRT/os/board/rtl8721csm/src/component/soc/realtek/amebad/fwlib/usb_otg/device/core/inc/dwc_otg_regs.h
/* ==========================================================================
 * $File: //dwh/usb_iip/dev/software/otg/linux/drivers/dwc_otg_regs.h $
 * $Revision: #99 $
 * $Date: 2012/12/10 $
 * $Change: 2123206 $
 *
 * Synopsys HS OTG Linux Software Driver and documentation (hereinafter,
 * "Software") is an Unsupported proprietary work of Synopsys, Inc. unless
 * otherwise expressly agreed to in writing between Synopsys and you.
 *
 * The Software IS NOT an item of Licensed Software or Licensed Product under
 * any End User Software License Agreement or Agreement for Licensed Product
 * with Synopsys or any supplement thereto. You are permitted to use and
 * redistribute this Software in source and binary forms, with or without
 * modification, provided that redistributions of source code must retain this
 * notice. You may not view, use, disclose, copy or distribute this file or
 * any information contained herein except pursuant to this license grant from
 * Synopsys. If you do not agree with this notice, including the disclaimer
 * below, then you are not authorized to use the Software.
 *
 * THIS SOFTWARE IS BEING DISTRIBUTED BY SYNOPSYS SOLELY ON AN "AS IS" BASIS
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE HEREBY DISCLAIMED. IN NO EVENT SHALL SYNOPSYS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
 * DAMAGE.
 * ========================================================================== */

#ifndef __DWC_OTG_REGS_H__
#define __DWC_OTG_REGS_H__

#include "dwc_otg_core_if.h"
/**
 * @file
 *
 * This file contains the data structures for accessing the DWC_otg core registers.
 *
 * The application interfaces with the HS OTG core by reading from and
 * writing to the Control and Status Register (CSR) space through the
 * AHB Slave interface. These registers are 32 bits wide, and the
 * addresses are 32-bit-block aligned.
 * CSRs are classified as follows:
 * - Core Global Registers
 * - Device Mode Registers
 * - Device Global Registers
 * - Device Endpoint Specific Registers
 * - Host Mode Registers
 * - Host Global Registers
 * - Host Port CSRs
 * - Host Channel Specific Registers
 *
 * Only the Core Global registers can be accessed in both Device and
 * Host modes. When the HS OTG core is operating in one mode, either
 * Device or Host, the application must not access registers from the
 * other mode. When the core switches from one mode to another, the
 * registers in the new mode of operation must be reprogrammed as they
 * would be after a power-on reset.
 */

/****************************************************************************/
/** DWC_otg Core registers .
 * The dwc_otg_core_global_regs structure defines the size
 * and relative field offsets for the Core Global registers.
 */
typedef struct dwc_otg_core_global_regs {
    /** OTG Control and Status Register.  <i>Offset: 000h</i> */
    volatile uint32_t gotgctl;
    /** OTG Interrupt Register.  <i>Offset: 004h</i> */
    volatile uint32_t gotgint;
    /**Core AHB Configuration Register.  <i>Offset: 008h</i> */
    volatile uint32_t gahbcfg;

#define DWC_GLBINTRMASK     0x0001
#define DWC_DMAENABLE       0x0020
#define DWC_NPTXEMPTYLVL_EMPTY  0x0080
#define DWC_NPTXEMPTYLVL_HALFEMPTY  0x0000
#define DWC_PTXEMPTYLVL_EMPTY   0x0100
#define DWC_PTXEMPTYLVL_HALFEMPTY   0x0000

    /**Core USB Configuration Register.  <i>Offset: 00Ch</i> */
    volatile uint32_t gusbcfg;
    /**Core Reset Register.  <i>Offset: 010h</i> */
    volatile uint32_t grstctl;
    /**Core Interrupt Register.  <i>Offset: 014h</i> */
    volatile uint32_t gintsts;
    /**Core Interrupt Mask Register.  <i>Offset: 018h</i> */
    volatile uint32_t gintmsk;
    /**Receive Status Queue Read Register (Read Only).  <i>Offset: 01Ch</i> */
    volatile uint32_t grxstsr;
    /**Receive Status Queue Read & POP Register (Read Only).  <i>Offset: 020h</i>*/
    volatile uint32_t grxstsp;
    /**Receive FIFO Size Register.  <i>Offset: 024h</i> */
    volatile uint32_t grxfsiz;
    /**Non Periodic Transmit FIFO Size Register.  <i>Offset: 028h</i> */
    volatile uint32_t gnptxfsiz;
    /**Non Periodic Transmit FIFO/Queue Status Register (Read
     * Only). <i>Offset: 02Ch</i> */
    volatile uint32_t gnptxsts;
    /**I2C Access Register.  <i>Offset: 030h</i> */
    volatile uint32_t gi2cctl;
    /**PHY Vendor Control Register.  <i>Offset: 034h</i> */
    volatile uint32_t gpvndctl;
    /**General Purpose Input/Output Register.  <i>Offset: 038h</i> */
    volatile uint32_t ggpio;
    /**User ID Register.  <i>Offset: 03Ch</i> */
    volatile uint32_t guid;
    /**Synopsys ID Register (Read Only).  <i>Offset: 040h</i> */
    volatile uint32_t gsnpsid;
    /**User HW Config1 Register (Read Only).  <i>Offset: 044h</i> */
    volatile uint32_t ghwcfg1;
    /**User HW Config2 Register (Read Only).  <i>Offset: 048h</i> */
    volatile uint32_t ghwcfg2;
#define DWC_SLAVE_ONLY_ARCH 0
#define DWC_EXT_DMA_ARCH 1
#define DWC_INT_DMA_ARCH 2

#define DWC_MODE_HNP_SRP_CAPABLE    0
#define DWC_MODE_SRP_ONLY_CAPABLE   1
#define DWC_MODE_NO_HNP_SRP_CAPABLE     2
#define DWC_MODE_SRP_CAPABLE_DEVICE     3
#define DWC_MODE_NO_SRP_CAPABLE_DEVICE  4
#define DWC_MODE_SRP_CAPABLE_HOST   5
#define DWC_MODE_NO_SRP_CAPABLE_HOST    6

    /**User HW Config3 Register (Read Only).  <i>Offset: 04Ch</i> */
    volatile uint32_t ghwcfg3;
    /**User HW Config4 Register (Read Only).  <i>Offset: 050h</i>*/
    volatile uint32_t ghwcfg4;
    /** Core LPM Configuration register <i>Offset: 054h</i>*/
    volatile uint32_t glpmcfg;
    /** Global PowerDn Register <i>Offset: 058h</i> */
    volatile uint32_t gpwrdn;
    /** Global DFIFO SW Config Register  <i>Offset: 05Ch</i> */
    volatile uint32_t gdfifocfg;
    /** ADP Control Register  <i>Offset: 060h</i> */
    volatile uint32_t adpctl;
    /** Reserved  <i>Offset: 064h-0FFh</i> */
    volatile uint32_t reserved39[39];
    /** Host Periodic Transmit FIFO Size Register. <i>Offset: 100h</i> */
    volatile uint32_t hptxfsiz;
    /** Device Periodic Transmit FIFO#n Register if dedicated fifos are disabled,
        otherwise Device Transmit FIFO#n Register.
     * <i>Offset: 104h + (FIFO_Number-1)*04h, 1 <= FIFO Number <= 15 (1<=n<=15).</i> */
    volatile uint32_t dtxfsiz[15];
} dwc_otg_core_global_regs_t;

/**
 * This union represents the bit fields of the Core OTG Control
 * and Status Register (GOTGCTL).  Set the bits using the bit
 * fields then write the <i>d32</i> value to the register.
 */
typedef union gotgctl_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned sesreqscs: 1;
        unsigned sesreq: 1;
        unsigned vbvalidoven: 1;
        unsigned vbvalidovval: 1;
        unsigned avalidoven: 1;
        unsigned avalidovval: 1;
        unsigned bvalidoven: 1;
        unsigned bvalidovval: 1;
        unsigned hstnegscs: 1;
        unsigned hnpreq: 1;
        unsigned hstsethnpen: 1;
        unsigned devhnpen: 1;
        unsigned reserved12_15: 4;
        unsigned conidsts: 1;
        unsigned dbnctime: 1;
        unsigned asesvld: 1;
        unsigned bsesvld: 1;
        unsigned otgver: 1;
        unsigned reserved1: 1;
        unsigned multvalidbc: 5;
        unsigned chirpen: 1;
        unsigned reserved28_31: 4;
    } b;
} gotgctl_data_t;

/**
 * This union represents the bit fields of the Core OTG Interrupt Register
 * (GOTGINT).  Set/clear the bits using the bit fields then write the <i>d32</i>
 * value to the register.
 */
typedef union gotgint_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Current Mode */
        unsigned reserved0_1: 2;

        /** Session End Detected */
        unsigned sesenddet: 1;

        unsigned reserved3_7: 5;

