Samsung/TizenRT/os/board/rtl8721csm/src/component/soc/realtek/amebad/fwlib/usb_otg/device/core/inc/dwc_otg_regs.h
        unsigned fs_phy_type: 2;
        unsigned num_dev_ep: 4;
        unsigned num_host_chan: 4;
        unsigned perio_ep_supported: 1;
        unsigned dynamic_fifo: 1;
        unsigned multi_proc_int: 1;
        unsigned reserved21: 1;
        unsigned nonperio_tx_q_depth: 2;
        unsigned host_perio_tx_q_depth: 2;
        unsigned dev_token_q_depth: 5;
        unsigned otg_enable_ic_usb: 1;
    } b;
} hwcfg2_data_t;

/**
 * This union represents the bit fields in the User HW Config3
 * Register.  Read the register into the <i>d32</i> element then read
 * out the bits using the <i>b</i>it elements.
 */
typedef union hwcfg3_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /* GHWCFG3 */
        unsigned xfer_size_cntr_width: 4;
        unsigned packet_size_cntr_width: 3;
        unsigned otg_func: 1;
        unsigned i2c: 1;
        unsigned vendor_ctrl_if: 1;
        unsigned optional_features: 1;
        unsigned synch_reset_type: 1;
        unsigned adp_supp: 1;
        unsigned otg_enable_hsic: 1;
        unsigned bc_support: 1;
        unsigned otg_lpm_en: 1;
        unsigned dfifo_depth: 16;
    } b;
} hwcfg3_data_t;

/**
 * This union represents the bit fields in the User HW Config4
 * Register.  Read the register into the <i>d32</i> element then read
 * out the bits using the <i>b</i>it elements.
 */
typedef union hwcfg4_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned num_dev_perio_in_ep: 4;
        unsigned power_optimiz: 1;
        unsigned min_ahb_freq: 1;
        unsigned hiber: 1;
        unsigned xhiber: 1;
        unsigned reserved: 6;
        unsigned utmi_phy_data_width: 2;
        unsigned num_dev_mode_ctrl_ep: 4;
        unsigned iddig_filt_en: 1;
        unsigned vbus_valid_filt_en: 1;
        unsigned a_valid_filt_en: 1;
        unsigned b_valid_filt_en: 1;
        unsigned session_end_filt_en: 1;
        unsigned ded_fifo_en: 1;
        unsigned num_in_eps: 4;
        unsigned desc_dma: 1;
        unsigned desc_dma_dyn: 1;
    } b;
} hwcfg4_data_t;

/**
 * This union represents the bit fields of the Core LPM Configuration
 * Register (GLPMCFG). Set the bits using bit fields then write
 * the <i>d32</i> value to the register.
 */
typedef union glpmctl_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** LPM-Capable (LPMCap) (Device and Host)
         * The application uses this bit to control
         * the DWC_otg core LPM capabilities.
         */
        unsigned lpm_cap_en: 1;
        /** LPM response programmed by application (AppL1Res) (Device)
         * Handshake response to LPM token pre-programmed
         * by device application software.
         */
        unsigned appl_resp: 1;
        /** Host Initiated Resume Duration (HIRD) (Device and Host)
         * In Host mode this field indicates the value of HIRD
         * to be sent in an LPM transaction.
         * In Device mode this field is updated with the
         * Received LPM Token HIRD bmAttribute
         * when an ACK/NYET/STALL response is sent
         * to an LPM transaction.
         */
        unsigned hird: 4;
        /** RemoteWakeEnable (bRemoteWake) (Device and Host)
         * In Host mode this bit indicates the value of remote
         * wake up to be sent in wIndex field of LPM transaction.
         * In Device mode this field is updated with the
         * Received LPM Token bRemoteWake bmAttribute
         * when an ACK/NYET/STALL response is sent
         * to an LPM transaction.
         */
        unsigned rem_wkup_en: 1;
        /** Enable utmi_sleep_n (EnblSlpM) (Device and Host)
         * The application uses this bit to control
         * the utmi_sleep_n assertion to the PHY when in L1 state.
         */
        unsigned en_utmi_sleep: 1;
        /** HIRD Threshold (HIRD_Thres) (Device and Host)
         */
        unsigned hird_thres: 5;
        /** LPM Response (CoreL1Res) (Device and Host)
         * In Host mode this bit contains handsake response to
         * LPM transaction.
         * In Device mode the response of the core to
         * LPM transaction received is reflected in these two bits.
            - 0x0 : ERROR (No handshake response)
            - 0x1 : STALL
            - 0x2 : NYET
            - 0x3 : ACK
         */
        unsigned lpm_resp: 2;
        /** Port Sleep Status (SlpSts) (Device and Host)
         * This bit is set as long as a Sleep condition
         * is present on the USB bus.
         */
        unsigned prt_sleep_sts: 1;
        /** Sleep State Resume OK (L1ResumeOK) (Device and Host)
         * Indicates that the application or host
         * can start resume from Sleep state.
         */
        unsigned sleep_state_resumeok: 1;
        /** LPM channel Index (LPM_Chnl_Indx) (Host)
         * The channel number on which the LPM transaction
         * has to be applied while sending
         * an LPM transaction to the local device.
         */
        unsigned lpm_chan_index: 4;
        /** LPM Retry Count (LPM_Retry_Cnt) (Host)
         * Number host retries that would be performed
         * if the device response was not valid response.
         */
        unsigned retry_count: 3;
        /** Send LPM Transaction (SndLPM) (Host)
         * When set by application software,
         * an LPM transaction containing two tokens
         * is sent.
         */
        unsigned send_lpm: 1;
        /** LPM Retry status (LPM_RetryCnt_Sts) (Host)
         * Number of LPM Host Retries still remaining
         * to be transmitted for the current LPM sequence
         */
        unsigned retry_count_sts: 3;
        /** Enable Best Effort Service Latency (BESL) (Device and Host)
         *  This bit enables the BESL features as defined in the LPM errata
         */
        unsigned en_besl: 1;

        unsigned reserved29: 1;
        /** In host mode once this bit is set, the host
         * configures to drive the HSIC Idle state on the bus.
         * It then waits for the  device to initiate the Connect sequence.
         * In device mode once this bit is set, the device waits for
         * the HSIC Idle line state on the bus. Upon receving the Idle
         * line state, it initiates the HSIC Connect sequence.
         */
        unsigned hsic_connect: 1;
        /** This bit overrides and functionally inverts
         * the if_select_hsic input port signal.
         */
        unsigned inv_sel_hsic: 1;
    } b;
} glpmcfg_data_t;

/**
 * This union represents the bit fields of the Core ADP Timer, Control and
 * Status Register (ADPTIMCTLSTS). Set the bits using bit fields then write
 * the <i>d32</i> value to the register.
 */
typedef union adpctl_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Probe Discharge (PRB_DSCHG)
         *  These bits set the times for TADP_DSCHG.
         *  These bits are defined as follows:
         *  2'b00 - 4 msec
         *  2'b01 - 8 msec
         *  2'b10 - 16 msec
         *  2'b11 - 32 msec
         */
        unsigned prb_dschg: 2;
        /** Probe Delta (PRB_DELTA)
         *  These bits set the resolution for RTIM   value.
         *  The bits are defined in units of 32 kHz clock cycles as follows:
         *  2'b00  -  1 cycles
         *  2'b01  -  2 cycles
         *  2'b10 -  3 cycles
         *  2'b11 - 4 cycles
         *  For example if this value is chosen to 2'b01, it means that RTIM
         *  increments for every 3(three) 32Khz clock cycles.
         */
        unsigned prb_delta: 2;
        /** Probe Period (PRB_PER)
         *  These bits sets the TADP_PRD as shown in Figure 4 as follows:
         *  2'b00  -  0.625 to 0.925 sec (typical 0.775 sec)
         *  2'b01  -  1.25 to 1.85 sec (typical 1.55 sec)
         *  2'b10  -  1.9 to 2.6 sec (typical 2.275 sec)
         *  2'b11  -  Reserved
         */
        unsigned prb_per: 2;
        /** These bits capture the latest time it took for VBUS to ramp from
         *  VADP_SINK to VADP_PRB.
         *  0x000  -  1 cycles
         *  0x001  -  2 cycles
         *  0x002  -  3 cycles
         *  etc
         *  0x7FF  -  2048 cycles
         *  A time of 1024 cycles at 32 kHz corresponds to a time of 32 msec.
        */
        unsigned rtim: 11;
        /** Enable Probe (EnaPrb)
         *  When programmed to 1'b1, the core performs a probe operation.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned enaprb: 1;
        /** Enable Sense (EnaSns)
         *  When programmed to 1'b1, the core performs a Sense operation.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned enasns: 1;
        /** ADP Reset (ADPRes)
         *  When set, ADP controller is reset.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adpres: 1;
        /** ADP Enable (ADPEn)
         *  When set, the core performs either ADP probing or sensing
         *  based on EnaPrb or EnaSns.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adpen: 1;
        /** ADP Probe Interrupt (ADP_PRB_INT)
         *  When this bit is set, it means that the VBUS
         *  voltage is greater than VADP_PRB or VADP_PRB is reached.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adp_prb_int: 1;
        /**
         *  ADP Sense Interrupt (ADP_SNS_INT)
         *  When this bit is set, it means that the VBUS voltage is greater than
         *  VADP_SNS value or VADP_SNS is reached.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adp_sns_int: 1;
        /** ADP Tomeout Interrupt (ADP_TMOUT_INT)
         *  This bit is relevant only for an ADP probe.
         *  When this bit is set, it means that the ramp time has
         *  completed ie ADPCTL.RTIM has reached its terminal value
         *  of 0x7FF.  This is a debug feature that allows software
         *  to read the ramp time after each cycle.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adp_tmout_int: 1;
        /** ADP Probe Interrupt Mask (ADP_PRB_INT_MSK)
         *  When this bit is set, it unmasks the interrupt due to ADP_PRB_INT.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adp_prb_int_msk: 1;
        /** ADP Sense Interrupt Mask (ADP_SNS_INT_MSK)
         *  When this bit is set, it unmasks the interrupt due to ADP_SNS_INT.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adp_sns_int_msk: 1;
        /** ADP Timoeout Interrupt Mask (ADP_TMOUT_MSK)
         *  When this bit is set, it unmasks the interrupt due to ADP_TMOUT_INT.
         *  This bit is valid only if OTG_Ver = 1'b1.
         */
        unsigned adp_tmout_int_msk: 1;
        /** Access Request
         * 2'b00 - Read/Write Valid (updated by the core)
         * 2'b01 - Read
         * 2'b00 - Write
         * 2'b00 - Reserved
         */
        unsigned ar: 2;
        /** Reserved */
        unsigned reserved29_31: 3;
    } b;
} adpctl_data_t;

