Samsung/TizenRT/os/board/rtl8721csm/src/component/soc/realtek/amebad/fwlib/usb_otg/device/core/inc/dwc_otg_regs.h
////////////////////////////////////////////
// Device Registers
/**
 * Device Global Registers. <i>Offsets 800h-BFFh</i>
 *
 * The following structures define the size and relative field offsets
 * for the Device Mode Registers.
 *
 * <i>These registers are visible only in Device mode and must not be
 * accessed in Host mode, as the results are unknown.</i>
 */
typedef struct dwc_otg_dev_global_regs {
    /** Device Configuration Register. <i>Offset 800h</i> */
    volatile uint32_t dcfg;
    /** Device Control Register. <i>Offset: 804h</i> */
    volatile uint32_t dctl;
    /** Device Status Register (Read Only). <i>Offset: 808h</i> */
    volatile uint32_t dsts;
    /** Reserved. <i>Offset: 80Ch</i> */
    uint32_t unused;
    /** Device IN Endpoint Common Interrupt Mask
     * Register. <i>Offset: 810h</i> */
    volatile uint32_t diepmsk;
    /** Device OUT Endpoint Common Interrupt Mask
     * Register. <i>Offset: 814h</i> */
    volatile uint32_t doepmsk;
    /** Device All Endpoints Interrupt Register.  <i>Offset: 818h</i> */
    volatile uint32_t daint;
    /** Device All Endpoints Interrupt Mask Register.  <i>Offset:
     * 81Ch</i> */
    volatile uint32_t daintmsk;
    /** Device IN Token Queue Read Register-1 (Read Only).
     * <i>Offset: 820h</i> */
    volatile uint32_t dtknqr1;
    /** Device IN Token Queue Read Register-2 (Read Only).
     * <i>Offset: 824h</i> */
    volatile uint32_t dtknqr2;
    /** Device VBUS  discharge Register.  <i>Offset: 828h</i> */
    volatile uint32_t dvbusdis;
    /** Device VBUS Pulse Register.  <i>Offset: 82Ch</i> */
    volatile uint32_t dvbuspulse;
    /** Device IN Token Queue Read Register-3 (Read Only). /
     *  Device Thresholding control register (Read/Write)
     * <i>Offset: 830h</i> */
    volatile uint32_t dtknqr3_dthrctl;
    /** Device IN Token Queue Read Register-4 (Read Only). /
     *  Device IN EPs empty Inr. Mask Register (Read/Write)
     * <i>Offset: 834h</i> */
    volatile uint32_t dtknqr4_fifoemptymsk;
    /** Device Each Endpoint Interrupt Register (Read Only). /
     * <i>Offset: 838h</i> */
    volatile uint32_t deachint;
    /** Device Each Endpoint Interrupt mask Register (Read/Write). /
     * <i>Offset: 83Ch</i> */
    volatile uint32_t deachintmsk;
    /** Device Each In Endpoint Interrupt mask Register (Read/Write). /
     * <i>Offset: 840h</i> */
    volatile uint32_t diepeachintmsk[MAX_EPS_CHANNELS];
    /** Device Each Out Endpoint Interrupt mask Register (Read/Write). /
     * <i>Offset: 880h</i> */
    volatile uint32_t doepeachintmsk[MAX_EPS_CHANNELS];
} dwc_otg_device_global_regs_t;

/**
 * This union represents the bit fields in the Device Configuration
 * Register.  Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.  Write the
 * <i>d32</i> member to the dcfg register.
 */
typedef union dcfg_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Device Speed */
        unsigned devspd: 2;
        /** Non Zero Length Status OUT Handshake */
        unsigned nzstsouthshk: 1;
#define DWC_DCFG_SEND_STALL 1

        unsigned ena32khzs: 1;
        /** Device Addresses */
        unsigned devaddr: 7;
        /** Periodic Frame Interval */
        unsigned perfrint: 2;
#define DWC_DCFG_FRAME_INTERVAL_80 0
#define DWC_DCFG_FRAME_INTERVAL_85 1
#define DWC_DCFG_FRAME_INTERVAL_90 2
#define DWC_DCFG_FRAME_INTERVAL_95 3

        /** Enable Device OUT NAK for bulk in DDMA mode */
        unsigned endevoutnak: 1;

        unsigned reserved14_17: 4;
        /** In Endpoint Mis-match count */
        unsigned epmscnt: 5;
        /** Enable Descriptor DMA in Device mode */
        unsigned descdma: 1;
        unsigned perschintvl: 2;
        unsigned resvalid: 6;
    } b;
} dcfg_data_t;

/**
 * This union represents the bit fields in the Device Control
 * Register.  Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union dctl_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Remote Wakeup */
        unsigned rmtwkupsig: 1;
        /** Soft Disconnect */
        unsigned sftdiscon: 1;
        /** Global Non-Periodic IN NAK Status */
        unsigned gnpinnaksts: 1;
        /** Global OUT NAK Status */
        unsigned goutnaksts: 1;
        /** Test Control */
        unsigned tstctl: 3;
        /** Set Global Non-Periodic IN NAK */
        unsigned sgnpinnak: 1;
        /** Clear Global Non-Periodic IN NAK */
        unsigned cgnpinnak: 1;
        /** Set Global OUT NAK */
        unsigned sgoutnak: 1;
        /** Clear Global OUT NAK */
        unsigned cgoutnak: 1;
        /** Power-On Programming Done */
        unsigned pwronprgdone: 1;
        /** Reserved */
        unsigned reserved: 1;
        /** Global Multi Count */
        unsigned gmc: 2;
        /** Ignore Frame Number for ISOC EPs */
        unsigned ifrmnum: 1;
        /** NAK on Babble */
        unsigned nakonbble: 1;
        /** Enable Continue on BNA */
        unsigned encontonbna: 1;
        /** Enable deep sleep besl reject feature*/
        unsigned besl_reject: 1;

        unsigned reserved17_31: 13;
    } b;
} dctl_data_t;

/**
 * This union represents the bit fields in the Device Status
 * Register.  Read the register into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union dsts_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Suspend Status */
        unsigned suspsts: 1;
        /** Enumerated Speed */
        unsigned enumspd: 2;
#define DWC_DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ 0
#define DWC_DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ 1
#define DWC_DSTS_ENUMSPD_LS_PHY_6MHZ           2
#define DWC_DSTS_ENUMSPD_FS_PHY_48MHZ          3
        /** Erratic Error */
        unsigned errticerr: 1;
        unsigned reserved4_7: 4;
        /** Frame or Microframe Number of the received SOF */
        unsigned soffn: 14;
        unsigned reserved22_31: 10;
    } b;
} dsts_data_t;

/**
 * This union represents the bit fields in the Device IN EP Interrupt
 * Register and the Device IN EP Common Mask Register.
 *
 * - Read the register into the <i>d32</i> member then set/clear the
 *   bits using the <i>b</i>it elements.
 */
typedef union diepint_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Transfer complete mask */
        unsigned xfercompl: 1;
        /** Endpoint disable mask */
        unsigned epdisabled: 1;
        /** AHB Error mask */
        unsigned ahberr: 1;
        /** TimeOUT Handshake mask (non-ISOC EPs) */
        unsigned timeout: 1;
        /** IN Token received with TxF Empty mask */
        unsigned intktxfemp: 1;
        /** IN Token Received with EP mismatch mask */
        unsigned intknepmis: 1;
        /** IN Endpoint NAK Effective mask */
        unsigned inepnakeff: 1;
        /** Reserved */
        unsigned emptyintr: 1;

        unsigned txfifoundrn: 1;

