Samsung/TizenRT/os/board/rtl8721csm/src/component/soc/realtek/amebad/fwlib/usb_otg/device/core/inc/dwc_otg_regs.h
} dwc_otg_dev_if_t;

/////////////////////////////////////////////////
// Host Mode Register Structures
//
/**
 * The Host Global Registers structure defines the size and relative
 * field offsets for the Host Mode Global Registers.  Host Global
 * Registers offsets 400h-7FFh.
*/
typedef struct dwc_otg_host_global_regs {
    /** Host Configuration Register.   <i>Offset: 400h</i> */
    volatile uint32_t hcfg;
    /** Host Frame Interval Register.   <i>Offset: 404h</i> */
    volatile uint32_t hfir;
    /** Host Frame Number / Frame Remaining Register. <i>Offset: 408h</i> */
    volatile uint32_t hfnum;
    /** Reserved.   <i>Offset: 40Ch</i> */
    uint32_t reserved40C;
    /** Host Periodic Transmit FIFO/ Queue Status Register. <i>Offset: 410h</i> */
    volatile uint32_t hptxsts;
    /** Host All Channels Interrupt Register. <i>Offset: 414h</i> */
    volatile uint32_t haint;
    /** Host All Channels Interrupt Mask Register. <i>Offset: 418h</i> */
    volatile uint32_t haintmsk;
    /** Host Frame List Base Address Register . <i>Offset: 41Ch</i> */
    volatile uint32_t hflbaddr;
} dwc_otg_host_global_regs_t;

/**
 * This union represents the bit fields in the Host Configuration Register.
 * Read the register into the <i>d32</i> member then set/clear the bits using
 * the <i>b</i>it elements. Write the <i>d32</i> member to the hcfg register.
 */
typedef union hcfg_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        /** FS/LS Phy Clock Select */
        unsigned fslspclksel: 2;
#define DWC_HCFG_30_60_MHZ 0
#define DWC_HCFG_48_MHZ    1
#define DWC_HCFG_6_MHZ     2

        /** FS/LS Only Support */
        unsigned fslssupp: 1;
        unsigned reserved3_6: 4;
        /** Enable 32-KHz Suspend Mode */
        unsigned ena32khzs: 1;
        /** Resume Validation Periiod */
        unsigned resvalid: 8;
        unsigned reserved16_22: 7;
        /** Enable Scatter/gather DMA in Host mode */
        unsigned descdma: 1;
        /** Frame List Entries */
        unsigned frlisten: 2;
        /** Enable Periodic Scheduling */
        unsigned perschedena: 1;
        unsigned reserved27_30: 4;
        unsigned modechtimen: 1;
    } b;
} hcfg_data_t;

/**
 * This union represents the bit fields in the Host Frame Remaing/Number
 * Register.
 */
typedef union hfir_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        unsigned frint: 16;
        unsigned hfirrldctrl: 1;
        unsigned reserved: 15;
    } b;
} hfir_data_t;

/**
 * This union represents the bit fields in the Host Frame Remaing/Number
 * Register.
 */
typedef union hfnum_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        unsigned frnum: 16;
#define DWC_HFNUM_MAX_FRNUM 0x3FFF
        unsigned frrem: 16;
    } b;
} hfnum_data_t;

typedef union hptxsts_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        unsigned ptxfspcavail: 16;
        unsigned ptxqspcavail: 8;
        /** Top of the Periodic Transmit Request Queue
         *  - bit 24 - Terminate (last entry for the selected channel)
         *  - bits 26:25 - Token Type
         *    - 2'b00 - Zero length
         *    - 2'b01 - Ping
         *    - 2'b10 - Disable
         *  - bits 30:27 - Channel Number
         *  - bit 31 - Odd/even microframe
         */
        unsigned ptxqtop_terminate: 1;
        unsigned ptxqtop_token: 2;
        unsigned ptxqtop_chnum: 4;
        unsigned ptxqtop_odd: 1;
    } b;
} hptxsts_data_t;

/**
 * This union represents the bit fields in the Host Port Control and Status
 * Register. Read the register into the <i>d32</i> member then set/clear the
 * bits using the <i>b</i>it elements. Write the <i>d32</i> member to the
 * hprt0 register.
 */
typedef union hprt0_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned prtconnsts: 1;
        unsigned prtconndet: 1;
        unsigned prtena: 1;
        unsigned prtenchng: 1;
        unsigned prtovrcurract: 1;
        unsigned prtovrcurrchng: 1;
        unsigned prtres: 1;
        unsigned prtsusp: 1;
        unsigned prtrst: 1;
        unsigned reserved9: 1;
        unsigned prtlnsts: 2;
        unsigned prtpwr: 1;
        unsigned prttstctl: 4;
        unsigned prtspd: 2;
#define DWC_HPRT0_PRTSPD_HIGH_SPEED 0
#define DWC_HPRT0_PRTSPD_FULL_SPEED 1
#define DWC_HPRT0_PRTSPD_LOW_SPEED  2
        unsigned reserved19_31: 13;
    } b;
} hprt0_data_t;

/**
 * This union represents the bit fields in the Host All Interrupt
 * Register.
 */
typedef union haint_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned ch0: 1;
        unsigned ch1: 1;
        unsigned ch2: 1;
        unsigned ch3: 1;
        unsigned ch4: 1;
        unsigned ch5: 1;
        unsigned ch6: 1;
        unsigned ch7: 1;
        unsigned ch8: 1;
        unsigned ch9: 1;
        unsigned ch10: 1;
        unsigned ch11: 1;
        unsigned ch12: 1;
        unsigned ch13: 1;
        unsigned ch14: 1;
        unsigned ch15: 1;
        unsigned reserved: 16;
    } b;

    struct {
        unsigned chint: 16;
        unsigned reserved: 16;
    } b2;
} haint_data_t;

/**
 * This union represents the bit fields in the Host All Interrupt
 * Register.
 */
typedef union haintmsk_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned ch0: 1;
        unsigned ch1: 1;
        unsigned ch2: 1;
        unsigned ch3: 1;
        unsigned ch4: 1;
        unsigned ch5: 1;
        unsigned ch6: 1;
        unsigned ch7: 1;
        unsigned ch8: 1;
        unsigned ch9: 1;
        unsigned ch10: 1;
        unsigned ch11: 1;
        unsigned ch12: 1;
        unsigned ch13: 1;
        unsigned ch14: 1;
        unsigned ch15: 1;
        unsigned reserved: 16;
    } b;

    struct {
        unsigned chint: 16;
        unsigned reserved: 16;
    } b2;
} haintmsk_data_t;

/**
 * Host Channel Specific Registers. <i>500h-5FCh</i>
 */
typedef struct dwc_otg_hc_regs {
    /** Host Channel 0 Characteristic Register. <i>Offset: 500h + (chan_num * 20h) + 00h</i> */
    volatile uint32_t hcchar;
    /** Host Channel 0 Split Control Register. <i>Offset: 500h + (chan_num * 20h) + 04h</i> */
    volatile uint32_t hcsplt;
    /** Host Channel 0 Interrupt Register. <i>Offset: 500h + (chan_num * 20h) + 08h</i> */
    volatile uint32_t hcint;
    /** Host Channel 0 Interrupt Mask Register. <i>Offset: 500h + (chan_num * 20h) + 0Ch</i> */
    volatile uint32_t hcintmsk;
    /** Host Channel 0 Transfer Size Register. <i>Offset: 500h + (chan_num * 20h) + 10h</i> */
    volatile uint32_t hctsiz;
    /** Host Channel 0 DMA Address Register. <i>Offset: 500h + (chan_num * 20h) + 14h</i> */
    volatile uint32_t hcdma;
    volatile uint32_t reserved;
    /** Host Channel 0 DMA Buffer Address Register. <i>Offset: 500h + (chan_num * 20h) + 1Ch</i> */
    volatile uint32_t hcdmab;
} dwc_otg_hc_regs_t;

/**
 * This union represents the bit fields in the Host Channel Characteristics
 * Register. Read the register into the <i>d32</i> member then set/clear the
 * bits using the <i>b</i>it elements. Write the <i>d32</i> member to the
 * hcchar register.
 */
typedef union hcchar_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        /** Maximum packet size in bytes */
        unsigned mps: 11;

        /** Endpoint number */
        unsigned epnum: 4;

        /** 0: OUT, 1: IN */
        unsigned epdir: 1;

        unsigned reserved: 1;

        /** 0: Full/high speed device, 1: Low speed device */
        unsigned lspddev: 1;

        /** 0: Control, 1: Isoc, 2: Bulk, 3: Intr */
        unsigned eptype: 2;

