Samsung/TizenRT/os/board/rtl8721csm/src/component/soc/realtek/amebad/fwlib/usb_otg/device/core/inc/dwc_otg_regs.h
        /** Packets per frame for periodic transfers. 0 is reserved. */
        unsigned multicnt: 2;

        /** Device address */
        unsigned devaddr: 7;

        /**
         * Frame to transmit periodic transaction.
         * 0: even, 1: odd
         */
        unsigned oddfrm: 1;

        /** Channel disable */
        unsigned chdis: 1;

        /** Channel enable */
        unsigned chen: 1;
    } b;
} hcchar_data_t;

typedef union hcsplt_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        /** Port Address */
        unsigned prtaddr: 7;

        /** Hub Address */
        unsigned hubaddr: 7;

        /** Transaction Position */
        unsigned xactpos: 2;
#define DWC_HCSPLIT_XACTPOS_MID 0
#define DWC_HCSPLIT_XACTPOS_END 1
#define DWC_HCSPLIT_XACTPOS_BEGIN 2
#define DWC_HCSPLIT_XACTPOS_ALL 3

        /** Do Complete Split */
        unsigned compsplt: 1;

        /** Reserved */
        unsigned reserved: 14;

        /** Split Enble */
        unsigned spltena: 1;
    } b;
} hcsplt_data_t;

/**
 * This union represents the bit fields in the Host All Interrupt
 * Register.
 */
typedef union hcint_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        /** Transfer Complete */
        unsigned xfercomp: 1;
        /** Channel Halted */
        unsigned chhltd: 1;
        /** AHB Error */
        unsigned ahberr: 1;
        /** STALL Response Received */
        unsigned stall: 1;
        /** NAK Response Received */
        unsigned nak: 1;
        /** ACK Response Received */
        unsigned ack: 1;
        /** NYET Response Received */
        unsigned nyet: 1;
        /** Transaction Err */
        unsigned xacterr: 1;
        /** Babble Error */
        unsigned bblerr: 1;
        /** Frame Overrun */
        unsigned frmovrun: 1;
        /** Data Toggle Error */
        unsigned datatglerr: 1;
        /** Buffer Not Available (only for DDMA mode) */
        unsigned bna: 1;
        /** Exessive transaction error (only for DDMA mode) */
        unsigned xcs_xact: 1;
        /** Frame List Rollover interrupt */
        unsigned frm_list_roll: 1;
        /** Reserved */
        unsigned reserved14_31: 18;
    } b;
} hcint_data_t;

/**
 * This union represents the bit fields in the Host Channel Interrupt Mask
 * Register. Read the register into the <i>d32</i> member then set/clear the
 * bits using the <i>b</i>it elements. Write the <i>d32</i> member to the
 * hcintmsk register.
 */
typedef union hcintmsk_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        unsigned xfercompl: 1;
        unsigned chhltd: 1;
        unsigned ahberr: 1;
        unsigned stall: 1;
        unsigned nak: 1;
        unsigned ack: 1;
        unsigned nyet: 1;
        unsigned xacterr: 1;
        unsigned bblerr: 1;
        unsigned frmovrun: 1;
        unsigned datatglerr: 1;
        unsigned bna: 1;
        unsigned xcs_xact: 1;
        unsigned frm_list_roll: 1;
        unsigned reserved14_31: 18;
    } b;
} hcintmsk_data_t;

/**
 * This union represents the bit fields in the Host Channel Transfer Size
 * Register. Read the register into the <i>d32</i> member then set/clear the
 * bits using the <i>b</i>it elements. Write the <i>d32</i> member to the
 * hcchar register.
 */

typedef union hctsiz_data {
    /** raw register data */
    uint32_t d32;

    /** register bits */
    struct {
        /** Total transfer size in bytes */
        unsigned xfersize: 19;

        /** Data packets to transfer */
        unsigned pktcnt: 10;

        /**
         * Packet ID for next data packet
         * 0: DATA0
         * 1: DATA2
         * 2: DATA1
         * 3: MDATA (non-Control), SETUP (Control)
         */
        unsigned pid: 2;
#define DWC_HCTSIZ_DATA0 0
#define DWC_HCTSIZ_DATA1 2
#define DWC_HCTSIZ_DATA2 1
#define DWC_HCTSIZ_MDATA 3
#define DWC_HCTSIZ_SETUP 3

        /** Do PING protocol when 1 */
        unsigned dopng: 1;
    } b;

    /** register bits */
    struct {
        /** Scheduling information */
        unsigned schinfo: 8;

        /** Number of transfer descriptors.
         * Max value:
         * 64 in general,
         * 256 only for HS isochronous endpoint.
         */
        unsigned ntd: 8;

        /** Data packets to transfer */
        unsigned reserved16_28: 13;

        /**
         * Packet ID for next data packet
         * 0: DATA0
         * 1: DATA2
         * 2: DATA1
         * 3: MDATA (non-Control)
         */
        unsigned pid: 2;

        /** Do PING protocol when 1 */
        unsigned dopng: 1;
    } b_ddma;
} hctsiz_data_t;

/**
 * This union represents the bit fields in the Host DMA Address
 * Register used in Descriptor DMA mode.
 */
typedef union hcdma_data {
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned reserved0_2: 3;
        /** Current Transfer Descriptor. Not used for ISOC */
        unsigned ctd: 8;
        /** Start Address of Descriptor List */
        unsigned dma_addr: 21;
    } b;
} hcdma_data_t;

/**
 * This union represents the bit fields in the DMA Descriptor
 * status quadlet for host mode. Read the quadlet into the <i>d32</i> member then
 * set/clear the bits using the <i>b</i>it elements.
 */
typedef union host_dma_desc_sts {
    /** raw register data */
    uint32_t d32;
    /** quadlet bits */

    /* for non-isochronous  */
    struct {
        /** Number of bytes */
        unsigned n_bytes: 17;
        /** QTD offset to jump when Short Packet received - only for IN EPs */
        unsigned qtd_offset: 6;
        /**
         * Set to request the core to jump to alternate QTD if
         * Short Packet received - only for IN EPs
         */
        unsigned a_qtd: 1;
        /**
         * Setup Packet bit. When set indicates that buffer contains
         * setup packet.
         */
        unsigned sup: 1;
        /** Interrupt On Complete */
        unsigned ioc: 1;
        /** End of List */
        unsigned eol: 1;
        unsigned reserved27: 1;
        /** Rx/Tx Status */
        unsigned sts: 2;
#define DMA_DESC_STS_PKTERR 1
        unsigned reserved30: 1;
        /** Active Bit */
        unsigned a: 1;
    } b;
    /* for isochronous */
    struct {
        /** Number of bytes */
        unsigned n_bytes: 12;
        unsigned reserved12_24: 13;
        /** Interrupt On Complete */
        unsigned ioc: 1;
        unsigned reserved26_27: 2;
        /** Rx/Tx Status */
        unsigned sts: 2;
        unsigned reserved30: 1;
        /** Active Bit */
        unsigned a: 1;
    } b_isoc;
} host_dma_desc_sts_t;

#define MAX_DMA_DESC_SIZE       131071
#define MAX_DMA_DESC_NUM_GENERIC    64
#define MAX_DMA_DESC_NUM_HS_ISOC    256
#define MAX_FRLIST_EN_NUM       64
/**
 * Host-mode DMA Descriptor structure
 *
 * DMA Descriptor structure contains two quadlets:
 * Status quadlet and Data buffer pointer.
 */
typedef struct dwc_otg_host_dma_desc {
    /** DMA Descriptor status quadlet */
    host_dma_desc_sts_t status;
    /** DMA Descriptor data buffer pointer */
    uint32_t buf;
} dwc_otg_host_dma_desc_t;

